app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "idNum", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Something is lame"], ["idNum", 122323], ["created_at", "2018-01-19 04:46:43.686085"], ["updated_at", "2018-01-19 04:46:43.686085"]]